describe("Testing of function pow", function() {

    it("возводит 2 в степень 3, ожидает 8", function() {
      assert.equal(pow(2, 3), 8);
    });

/*
Мы могли не писать ещё один it и новый тест с assert.equal загнать в первый блок it,
но лучше разделять тесты - так мы получим больше наглядной информации в случае ошибки
*/
    it("возводит 3 в степень 3, ожидает 27", function() {
        assert.equal(pow(3, 3), 27);
    });
});

  /*
Спецификация состоит из трёх основных блоков:

describe("заголовок", function() { ... })
Какую функциональность мы описываем. В нашем случае мы описываем функцию pow.
Используется для группировки рабочих лошадок – блоков it.

it("описание", function() { ... })
В первом аргументе блока it мы человеческим языком описываем конкретный способ использования функции,
а во втором – пишем функцию, которой будем тестировать данный случай.

assert.equal(value1, value2)
Код внутри блока it, если функция работает верно, должен выполняться без ошибок.
Функции вида assert.* используются для проверки того, что функция pow работает так, как мы ожидаем.
В этом примере мы используем одну из них – assert.equal, которая сравнивает переданные значения и выбрасывает ошибку,
если они не равны друг другу.

Существуют и другие типы сравнений и проверок, которые мы добавим позже.
Спецификация может быть запущена, и при этом будет выполнена проверка, указанная в блоке it, мы увидим это позднее.
  */