/* Простенький калькулятор часов, дней и лет моей жизни
 для теста преобразования объектов в числа,
 вычитания объектов, округления цифр
 и преобразования объектов в строки. 
*/

'use strict';
let birthday = new Date("1993-12-06");
let now = new Date();

console.log (`Мой день рождения ${birthday}`);
console.log (`Сегодняшняя дата: ${now}`);

//Math.floor - выводит только целую часть числа, без округления. toFixed(1) - даёт 1 знак после запятой.

alert(((now-birthday)/3600000).toFixed(1) + " часов");
alert(Math.floor((now-birthday)/86400000) + " дней");
alert(Math.floor((now-birthday)/3.1536e10) + " лет");

// P.S.: Надо более точно указать дату рождения в будущем, с учётом того, что я родился где-то в 6 часов утра.

/* + в будущем стоит усовершенствовать формат вывода: "С моего рождения прошло x лет, y дней, z часов".
Видимо, делать это придётся через остатки от деления...
*/

