/*Задача:
Напишите код, который выводит все простые числа из интервала от 2 до n.
Для n = 10 результат должен быть 2,3,5,7.
Код также должен легко модифицироваться для любых других интервалов.
*/
let i,n;
do
{
i = +prompt ("Введите нижнюю границу диапазона","");
n = +prompt("Введите верхнюю границу диапазона","");
}
while (i<2 || n<2);

NextTry:
for(i; i<=n; i++)
{
    for (let j = 2; j<i;j++)
    {
        if (i%j==0) continue NextTry;
    }
    console.log (`${i} - натуральное число`);
}
console.log(`Верхняя граница = ${n}`);
alert("Готово!")
;