/* Задача: Сумма с помощью замыканий. Важность: 4.

Напишите функцию sum, которая работает таким образом: sum(a)(b) = a+b.
Да, именно таким образом, используя двойные круглые скобки (не опечатка).

sum(1)(2) = 3
sum(5)(-1) = 4
*/

'use strict';

function sum(a) {
    return function /*sum2*/ (b) {
    return a+b;
    }
}

console.log(sum (1)(2));
console.log(sum (5)(-1));

/* 
Имя второй функции можно опустить, т.к. мы создаём её внутри функции и сразу же вызываем.
Чтобы заработали вторые скобки первые должны вернуть функцию.
*/
