/* Задача:

Напишите функцию filterRangeInPlace(arr, a, b), которая принимает массив arr и удаляет из него все значения
кроме тех, которые находятся между a и b. То есть, проверка имеет вид a ≤ arr[i] ≤ b.

Функция должна изменять принимаемый массив и ничего не возвращать.

Например:
let arr = [5, 3, 8, 1];
filterRangeInPlace(arr, 1, 4); // удалены числа вне диапазона 1..4
alert( arr ); // [3, 1]
*/

let arr = [5, 3, 8, 1];
console.log( "Оригинальный массив: " + arr);
filterRangeInPlace(arr, 1, 4);
alert ( "Отфильтрованный оригинальный массив: " + arr);

function filterRangeInPlace(arr, a, b) {
    for (i = 0 ; i <= arr.length ; i++ ) {
        let element = arr[i];
        
        if (element < a || element > b) { // просто обратное условие для element >= a && element <=b
            arr.splice(i,1);
           i--; // видимо нужен для уменьшения итераций цикла.
        }
    }
};

/*
С этой задачей пришлось конкретно подсмотреть.

Надо обязательно помнить, что возвращает Splice, а что - Slice.
Здесь это меня сильно подвело.

i-- изначально у меня тоже не было.
Ну и само уравнение условия - что-то я не додумался его "обратить".
*/