/* Задача: Преобразуйте объект в JSON, а затем обратно в обычный объект. Важность: 5.

Преобразуйте user в JSON, затем прочитайте этот JSON в другую переменную.
*/

let user = {
    name: "Василий Иванович",
    age: 35
};

let json = JSON.stringify(user);
alert( json ); // {"name":"Василий Иванович","age":35}

let obj = JSON.parse(json);
alert (obj); // { name: 'Василий Иванович', age: 35 }

/* 
Решение автора:

let user2 = JSON.parse(JSON.stringify(user));

Нам такой вариант не совсем подошёл бы, так как корректнее было взглянуть на оба результата и сравнить их с оригиналом.
*/