/* Запускай только если хочешь "уронить" IDE.

Задача:
Этот цикл – бесконечный. Он никогда не завершится, почему?
*/

let i = 0;
while (i != 10) {
  console.log(i);
  i += 0.2;
}

/*
Тут всё просто и ясно, мы даём точное ограничение на наше число,
"Не ровно 10"
Но наше число из-за неточностей никогда не будет равно 10.


Вот ответ автора:
Потому что i никогда не станет равным 10.
Запустите скрипт и вы увидите реальные значения i:

let i = 0;
while (i < 11) {
  i += 0.2;
  if (i > 9.8 && i < 10.2) alert( i );
}

Ни одно из этих чисел не равно 10.
Это происходит из-за потери точности, при прибавлении таких дробей как 0.2.
Вывод: ИЗБЕГАЙТЕ ПРОВЕРОК НА РАВЕНСТВО ПРИ РАБОТЕ С ДЕСЯТИЧНЫМИ ДРОБЯМИ.
*/