/* Задача:

Напишите функцию pow(x,n), которая возвращает x в степени n. Иначе говоря, умножает x на себя n раз и возвращает результат.

Пример:
pow(3, 2) = 3 * 3 = 9
pow(3, 3) = 3 * 3 * 3 = 27
pow(1, 100) = 1 * 1 * ...* 1 = 1

Создайте страницу, которая запрашивает x и n, а затем выводит результат pow(x,n).

P.S. В этой задаче функция обязана поддерживать только натуральные значения n, т.е. целые от 1 и выше.
*/

function pow (x,n)
{
return x**n;
}

let x = +prompt ("Введите число, возводимое в степень","");
let n = +prompt ("Введите степень","");

if (n>1)
{
    console.log (`${x} в степени ${n} равно ${pow(x,n)}`);
}
else
{
    console.log ('Были введены некорректные данные.');
}