/* Задача 6: Сколько сегодня прошло секунд? Важность: 5.

Напишите функцию getSecondsToday(), возвращающую количество секунд с начала сегодняшнего дня.
Например, если сейчас 10:00, и не было перехода на зимнее/летнее время, то:
getSecondsToday() == 36000 // (3600 * 10)
Функция должна работать в любой день, т.е. в ней не должно быть конкретного значения сегодняшней даты.
*/

let now = new Date();
alert (`С начала дня прошло ${getSecondsToday()} cекунд`);
alert (`Дао завтрашнего дня осталось ${getSecondsToTomorrow()} секунд`);

function getSecondsToday() {

    let now0 = new Date(now.getFullYear(), now.getMonth(), now.getDate(),)

    let sec = Math.round((now - now0)/1000);
    return sec;
}

//----------------------------------------------------------------------------------------------------------------------------------------------

/* Задача 7: Сколько секунд осталось до завтра? Важность: 5.

Создайте функцию getSecondsToTomorrow(), возвращающую количество секунд до завтрашней даты.

Например, если сейчас 23:00, то: getSecondsToTomorrow() == 3600

P.S. Функция должна работать в любой день, т.е. в ней не должно быть конкретного значения сегодняшней даты.
*/

function getSecondsToTomorrow() {

    let tomorrow = new Date(now.getFullYear(), now.getMonth(), now.getDate()+1,)

    let sec = Math.round((tomorrow - now)/1000);
    return sec;
}
