/* Задача: Какой день месяца был много дней назад? Важность: 4.

Создайте функцию getDateAgo(date, days), возвращающую число, которое было days дней назад от даты date.
К примеру, если сегодня двадцатое число, то getDateAgo(new Date(), 1) вернёт девятнадцатое и getDateAgo(new Date(), 2) – восемнадцатое.
Функция должна надёжно работать при значении days=365 и больших значениях.
*/

let date = new Date(2015, 0, 2);
(getDateAgo(date));
alert(date); // Проверяем, что дата не изменилась, в соответствии с требованиями 

function getDateAgo(d) { // d - Установленная дата.
    let sub = +prompt("Введите количество дней: ","1"); 
    let days = new Date(d.getFullYear(), d.getMonth() ,d.getDate() - sub);

    alert (days); // Проверяем, какую дату определяет наша функция.

    return alert(`${sub} дней назад было ${days.getDate()}-е число.`)
}