/* Задача: Оставить уникальные элементы массива. Важность: 4.

Пусть arr – массив строк.
Напишите функцию unique(arr), которая возвращает массив, содержащий только уникальные элементы arr.

*/

let strings = ["харе", "кришна", "кришна", "харе",
"харе", "харе", "кришна", "кришна", ":-O"
];
  
alert( unique(strings) ); // кришна, харе, :-O

function unique(arr) {
    let resArr = [];

    for (let str of arr) {
        if (!resArr.includes(str)) {
        resArr.push(str)} 
    };
return resArr;
}

/*
С кодом, а вернее с логикой его работы конечно же возникли проблемы

Автор утверждает, что этот уод - далеко не оптимальное решение.
Метод resArr.includes (str) обходит массив resArr и каждый элемент сравнивает с str.

Если массив большой и мы будем делать всё это в цикле, то количество сравнений можно возводить в квадрат.
Так, если у нас есть массив длинной 10 000 - получим 100 000 000 сравнений.
Это серьёзно ударит по производительности.
*/