/* Задача:

Создайте функцию truncate(str, maxlength), которая проверяет длину строки str и, если она превосходит maxlength,
заменяет конец str на "…", так, чтобы её длина стала равна maxlength.
Результатом функции должна быть та же строка, если усечение не требуется, либо, если необходимо, усечённая строка.

Например:

truncate("Вот, что мне хотелось бы сказать на эту тему:", 20) = "Вот, что мне хотело…"
truncate("Всем привет!", 20) = "Всем привет!"

*/

'use strict';
let str;
let maxlength;

do {
    str = prompt("Сообщение:","");
    maxlength = +prompt("Сколько символов оставить?","");
}
while (!str) ;

alert ("Итог: " + truncate(str, maxlength));

function truncate() {
    let warning = "Вы не оставили ни одного символа.";
    let str_m = str.substr(0,maxlength);

    if (maxlength >= str.length) {
        return str;
    } if (maxlength == 0) {
        return warning;
    } else {
    return str_m + '\u2026';
}};

/*
Решение автора:
Строка, которую мы возвращаем, должна быть не длиннее maxlength, поэтому, если мы обрезаем строку,
то мы должны убрать на один символ больше, чем maxlength — чтобы хватило места на многоточие.

Имейте в виду, что в качестве многоточия здесь используется … — ровно один специальный Юникодный символ.
Это не то же самое, что ... — три точки.

//Спасибо автору, что об этом он упомянул именно в решении, а не в условии!
//В условии не указано, что результатом не может быть новая строка.

function truncate(str, maxlength) {
  return (str.length > maxlength) ?
    str.slice(0, maxlength - 1) + '…' : str;
}
*/