/* Задача: Вычислить факториал. Важность: 4.

Факториал натурального числа – это число, умноженное на "себя минус один", затем на "себя минус два", и так далее до 1. Факториал n обозначается как n!

Определение факториала можно записать как:
n! = n * (n - 1) * (n - 2) * ...*1

Задача – написать функцию factorial(n), которая возвращает n!, используя рекурсию.
P.S. Подсказка: n! можно записать как n * (n-1)! Например: 3! = 3*2! = 3*2*1! = 6
*/

let n = +prompt("Введите число, от которого будем получать факториал: ","3");

alert(`${n}! = ${factorial(n)}`);

function factorial(n) {
    let res = 0;
    if (n == 1) return 1;
    return res = n * factorial(n-1);
}

/*
Кстати, автор говорит, что можно было бы написать намного короче:
return (n == 1) ? 1 : n * factorial(n-1);
*/