/* Задание: Совпадение для /d+? d+?/

Какое здесь будет совпадение для шаблона /d+? d+?/ ?
*/

"123 456".match(/\d+? \d+?/g); // 123 4

/* Шаблон говорит нам: 
Ищем цифры по одной, сдивгаясь слева направо.
После n-го количества цифр должен быть пробел и ещё цифры.

123 войдёт в шаблон, потому что после них есть пробел.

А вот во второй части будет всего 1 цифра - 4.
Почему? Потому что после "456" нет пробела.

Т.О. первый ленивый шаблон как можно больше цифр до пробела, а
вот второй ленивый шаблон возьмёт одну цифру и остановится.
*/

// Побалуемся немного:
let str = "123 456";
let res1, res2, res3;
res1 = str.match(/\d+?\d+?/g); // ["12","45"]
res2 = str.match(/\d+\d+/g)    // ["123","456]
res3 = str.match(/\d+\d+?/g)   // ["123","456]