let str = "Сегодня отличный день для изучения регулярных выражений!";

let result = str.match(/сегодня отличный день/i);
console.log(result); // [Сегодня отличный день] - массив с 1-м элементом с индексом 0 и длинной 1

result = str.match(/сегодня отличный день/g);
console.log(result); // null

result = str.replace(/Сегодня отличный день/, "$&, но не");
console.log(result); // Сегодня отличный день, но не для изучения регулярных выражений! - строка

result = str.replace(/ для изучения регулярных выражений/, ", чтобы ничего не делать");
console.log(result); // Сегодня отличный день, чтобы ничего не делать! - строка