/* Задача: Сумма введённых чисел. Важность: 4.

Напишите функцию sumInput(), которая:

Просит пользователя ввести значения, используя prompt и сохраняет их в массив.
Заканчивает запрашивать значения, когда пользователь введёт не числовое значение, пустую строку или нажмёт «Отмена».
Подсчитывает и возвращает сумму элементов массива.
P.S. Ноль 0 – считается числом, не останавливайте ввод значений при вводе «0».

*/

let arr = [];
alert ("Сумма элементов массива = " + sumInput(arr));

function sumInput(arr) {

let elem;
let sum = 0;

for (let i =0; ; i++) {
elem = prompt("Введите число: ","");

if (!Number.isFinite(+elem) || elem === '' || elem === null) {
    return sum;
} else { 
    arr[i] = +elem;
    sum += +elem;
}}
}