/* Задача: Случайное число от min до max. Важность: 2.

Встроенный метод Math.random() возвращает случайное число от 0 (включительно) до 1 (но не включая 1)
Напишите функцию random(min, max), которая генерирует случайное число с плавающей точкой от min до max (но не включая max).

*/

let min = +prompt("Введите минимум диапазона: ","");
let max = +prompt("Введите максимум диапазона: ","");
random(min, max);

function random(min, max){

let rand = min + Math.random() * (max-min);
return alert("Сгенерированное число: " + rand);
};