/* Задача: Сделать первый символ заглавным. Важность: 5.

Напишите функцию ucFirst(str), возвращающую строку str с заглавным первым символом. Например:
ucFirst("вася") == "Вася";

*/

let str = prompt("Введите слово. Запись начинайте с маленькой буквы: ","вася");

ucFirst(str);

function ucFirst(str) {
    
if (!str) return alert("Введена пустая строка");

str = str[0].toUpperCase() + str.substr(1);
alert (str);
}

/*

Изначально не было проверки на пустую строку, однако автор в своём решении 
приводит её. Пришлось добавить.
В условии про отладку ввода на предмет пустой строки ничего не сказано...

*/