/* Задача: Подсчёт количества свойств объекта. Важность: 5.

Напишите функцию count(obj), которая возвращает количество свойств объекта.
Постарайтесь сделать код как можно короче.
P.S. Игнорируйте символьные свойства, подсчитывайте только «обычные».

*/

let user = {
    name: 'John',
    age: 30,
    street: 'Hamilton st.',
    home: 5,
  };
  
  alert( count(user) ); // 2

function count(obj) {

return Object.entries(obj).length
}

/*
Ошибка - забыл о существовании свойства length.

Object.length - не сработает, выдаст нам 1-цу.
Объекты вовсе не располагают свойством length, определяющим их размер.

Потому используем Object.entries(obj).length или Object.keys(obj).length.
Без свойства length они вернут массив свойств/ключей объекта.
*/