/* Задача:

Встроенный метод Math.random() возвращает случайное число от 0 (включительно) до 1 (но не включая 1).
Напишите функцию random(min, max), которая генерирует случайное число
с плавающей точкой от min до max (но не включая max).

*/

'use strict'
function random(min, max) {
let answer = min + Math.random() * (max-min);
return answer.toFixed(3); // Добавил округление до 3 символов
}

let min = +prompt("Введите число - минимум: ","");
let max = +prompt("Введите число - максимум: ","");
alert(random(min, max));

/*
Сам метод min + Math.random() * (max-min)) пришлось подсматривать, хоть я и понимал логику того,
как это можно было бы сделать.

Решение автора:
Это можно сделать в 2 шага:

Если мы умножим случайное число от 0…1 на max-min,
тогда интервал возможных значений от 0..1 увеличивается до 0..max-min.
И, если мы прибавим min, то интервал станет от min до max.
*/