/* Задача:

Можно ли добавить свойство строке?
Взгляните на следующий код и запустите его в разных режимах:

let str = "Привет";
str.test = 5;
alert(str.test);
*/

//'use strict'

let str = "Привет";
str.test = 5;
alert(str.test);

/* В зависимости от режима получим:
- undefined (без strict)
- Ошибка (strict mode)

Происходит это из-за того, что в момент обращения к свойству str JS создаёт "объект-обёртку".

В строгом режиме сама попытка изменить этот объект уже даст нам ошибку.

Без строгого режима операция продолжится, наша str получит свойство test, но оно
сразу же удалится и в порследней строке кода алерт обратится к уже не существующему свойству test.

Это доказывает, что примитивы не могут быть объектами и не могут хранить дополнительные данные.
*/
