/* Задача:
Есть стоимость в виде строки "$120". То есть сначала идёт знак валюты, а затем – число.

Создайте функцию extractCurrencyValue(str), которая будет из такой строки выделять числовое значение и возвращать его.

Например:
alert( extractCurrencyValue('$120') === 120 ); // true
*/

let str = prompt("Введите число с каким-либо символов перед ним:","");
alert (extractCurrencyValue(str));

function extractCurrencyValue(){
let str_m = str.slice(1);
return +str_m; 
};

/*
Изначально думал, что туту будет какая-то ловушка, что надо попробовать как-то хитрить и "парсить"
нашу строку, ведь мало ли символов будет не один, ведь об этом в условие ничего явно не сказано.

Но нет, тут всё оказалось крайне легко.

Хотя усложнённый вариант это задачи мог бы быть с поиском кодов Unicode 16 и т.д.

Надо бы потом реализовать...

Ответ автора:
function extractCurrencyValue(str) {
  return +str.slice(1);
}
*/