/* Задача:

let arr = [5, 2, 1, -10, 8];

// ... ваш код для сортировки по убыванию

alert( arr ); // 8, 5, 2, 1, -10

*/

let arr = [5, 2, 1, -10, 8];

arr.sort(compareNumeric);

alert( arr ); // 8, 5, 2, 1, -10


function compareNumeric(a, b) {
    if (a > b) return -1;
    if (a == b) return 0;
    if (a < b) return 1;
};

/* Я уже поупражняся в сортировке чисел в 5.37.2, 
поэтому эта задача зашла легко. Единственное, что можно было бы сделать - изменить аргумент
compareNumeric на гораздо более простую стролочную функцию ((a, b) => b - a).

Это видно из примера автора:

let arr = [5, 2, 1, -10, 8];
arr.sort((a, b) => b - a);
alert( arr );

*/