/* Задание: Найдите время как hh:mm или hh-mm.
Время может быть в формате HH:MM или HH-MM. И часы, и минуты имеют две цифры: 09:00 или 21-30.
*/

let regexp = /\d\d[:-]\d\d/g;
let str = "Завтрак в 09:00. Ужин в 21-30"
alert( str.match(regexp) ); // [09:00, 21-30]

/* P.S.: Здесь нам предлагают не делать проверку на корректность времени.
Пока мы не знаем, как сделать это полностью корректно и, следовательно, 
мы можем сделать максимум такую проверку:
*/

regexp = /[0-2][0-9][-:][0-5][0-9]/g
str = "Завтрак в 09:00. Ужин в 21-30. Код от двери столовой 88-62-29-33"
alert( str.match(regexp) ); // [09:00, 21-30, 29-33]

// Проблема именно в проверке цифры после 2-ки.

//Подсмотренная и доработанная регулярка для времени:
regexp = /\b([01][0-9]|2[0-3])[-:.]([0-5][0-9])\b/g;
str = "Завтрак в 09:00. Ужин в 21-30. Код от двери столовой 88-62-22-336"
alert( str.match(regexp) ); // [09:00, 21-30]

// Теперь мы проверяем, что цифры будет 2 (границы) и что цифры "корректны".