/*
Просто небольшое баловство с повторением некоторым простейших вещей, которые я 
успел подзабыть.

Причём тут есть куда улучшать и оптимизировать данный код. Много вариантов, что с ним 
можно сделать, но это всё же тема регулярок и поэтому я остановился на таком, довольно
корявом решении поставленной мне самим же собой задачи.
*/

let costRegexp = /\d+(\.\d+)?(?=[€$])/g;
let countryRegexp = /(?<!(\.\s))[A-Я][а-я]{1,}(?!(., ))/gs;

let str = "В Турции 1 кг индейки стоит 3.95$, а в России - 4.22$. \n Посчитайте, сколько же будет стоить 1.5 кг индейки?";

let country = str.match(countryRegexp);

/*
Тут не мешало бы придумать, как извлечь названия стран.
Возможно в последних темах регулярок будет что-то подобное?

Ведь регуляркой выбивать именно названия стран из полноценного теста на первый взгляд можно
только по большим буквам, расположенным посреди строки. И это не так уж надёжно...
*/

let howMany = str.match(costRegexp);
alert( "Цена за один килограмм: " + howMany);

multiple(howMany, country);

function multiple(arr) {
  let i = 0;
  
  for (let value of arr){
  value = value*1.5;
  alert (`Цена за полтора килограмма индейки в ${country[i]}: ${value.toFixed(2)}$`);
  i += 1;
  }
};