/* Задание: Вставьте тег после фрагмента
У нас есть строка с HTML-документом.

Напишите регулярное выражение которое вставляет <h1>Hello</h1> сразу же после тега <body>.
У тега <body> могут быть атрибуты.
*/

let regexp = /(?<=<body.*?>)/g;

let str = `
<html>
  <body style="height: 200px">
  ...
  </body>
</html>
`;

str = str.replace(regexp,`\n    <h1>Hello</h1>`);
alert(str);

/*
Сначала сделал так: regexp =  /(?<=<body(>|.)+?>)/g;
Но тут ошибка, если тег без атрибутов - не находит совпадений из-за плюса.
Да и скобки не очень корректно были расставленны.

Надо хотя бы так:
regexp = /(?<=<body(>|.*?>))/g;
*/