/* Задача: Функция в if. Важность: ?

Посмотрите на код. Какой будет результат у вызова на последней строке?
*/
'use strict';
let phrase = "Hello";

if (true) {
  let user = "John";

  function sayHi() {
    alert(`${phrase}, ${user}`);
  }
}

sayHi();

/* А вот здесь возникает интересный момент с разницей режимов:

1) Используем 'use strict'? Получаем, как и кажется на первый взгляд, закономерную ошибку,
   ведь наша функция объявлена внутри блока кода if и получить к ней доступ извне - нельзя.
2) "Забудем" использовать 'use strict'. Код заработает и мы получим alert с "Hello, John".

*/