// Пример с Map - так делать не стоит:

// 📁 cache.js
let cache = new Map();

function process(obj) {
  
    if (!cache.has(obj)) {
    let result = /* тут какие-то вычисления результата для объекта */ obj;

    cache.set(obj, result);
    }

return cache.get(obj);
}

// Теперь используем process() в другом файле 📁 main.js

let obj = {/* допустим, у нас есть какой-то объект */};

let result1 = process(obj); // вычислен результат

// ... ///

let result2 = process(obj); // ранее вычисленный результат взят из кеша

// ...позже, когда объект больше не нужен:
obj = null;

alert(cache.size); // 1 (Упс! Объект всё ещё в кеше, занимает память!)

/* Многократные вызовы process(obj) с тем же самым объектом в качестве аргумента ведут к тому,
что результат вычисляется только в первый раз, а затем последующие вызовы берут его из кеша.

Недостаток - необходимость вручную очищать cache от ставших ненужными объектов.

Но если мы будем использовать WeakMap вместо Map, то эта проблема исчезнет:
закешированные результаты будут автоматически удалены из памяти сборщиком мусора.
*/

//------------------------------------------------------------------------------------------------------------------------------------------------------

// Пример с WeakMap:

// 📁 cache.js
let cache2 = new WeakMap();

// вычисляем и запоминаем результат
function process(obj) {
  if (!cache2.has(obj)) {
    let result = /* вычисляем результат для объекта */ obj;

    cache2.set(obj, result);
  }

  return cache2.get(obj);
}

// 📁 main.js
let obj2 = {/* какой-то объект */};

let result3 = process(obj);
let result4 = process(obj);

// ...позже, когда объект больше не нужен:
obj2 = null;

// Кстати, у нас нет возможности получить cache.size, так как это WeakMap, но он равен 0 или скоро будет равен 0,
// т.к. сборщик мусора удаляет obj и связанные с ним данные из кеша тоже удаляются.