alert(4>3<5) // true
alert(1 < 2 < 3) // true

alert(4>3>2) // false?!
alert(3>2>1) // false?!

/*
Пояснение:
4 > 3 -> true, затем true > 2 -> false. 

Т.О. знаки сравнения возвращают true или false. Если за ними следует ещё одно сравнение -
  происходит сравнение с true или false, а не с числом перед вторым знаком сравнения.
*/

/* Ещё пример с возвращение false: */
let x = 1 > 2;
if (x.toString().length == 5){
alert('Ok');
}

/* Да, алерт выведет нам Ок, так как x = false. Затем false становится 'false', а длина строки 'false' == 5 */