/* Задача: Фильтрация по диапазону. Важность: 4.

Напишите функцию filterRange(arr, a, b), которая принимает массив arr,
ищет элементы со значениями больше или равными a и меньше или равными b и возвращает результат в виде массива.

Функция должна возвращать новый массив и не изменять исходный.

*/

let arr = [5, 3, 8, 1];
alert (filtered(arr));
alert (arr);

function filtered(arr) {
let a = +prompt("Введите нижний диапазон: ","1");
let b = +prompt("Введите верхний диапазон: ","4");
arr = arr.filter (item => (item>= a && item <= b));
return arr;
} 