/* Задача: Ввод числового значения, важность: 5.

Создайте функцию readNumber, которая будет запрашивать ввод числового значения.
Ввод должен запрашиваться до тех пор, пока посетитель его не введёт число.

Функция должна возвращать числовое значение.

Также надо разрешить пользователю остановить процесс ввода,
отправив пустую строку или нажав «Отмена». В этом случае функция должна вернуть null.
*/

readnumber();

function readnumber() {
  
let a = prompt("Введите число: ","");

  if (!Number.isFinite(+a)) {
    readnumber() }
    else { if (a === '') {
    return null; }
        else {
        return alert(`Введённое число: ${+a}`); }
    };
};

/* Первый раз эта задача делалась мно. через Do ... While, как и у автора.
В этот раз я немного поменял для себя "условия" и выполнил рекурсию.

Единственная ошибка - не стоит вызывать функцию в алертах. Забыл об этом.

Ответ автора смотри в 5.34.3.js
*/