/* Задача та же,
но постараемся видоизменить её под видение автора и расширить её функционал.
Возможно даже написать тест для её проверки.

Пока не удаётся разобраться с тем, как предотвратить ввод некоректных данных в методе read...
*/

function Accumulator(StartingValue){
    
  this.value = +StartingValue,

  this.read = function(){
      this.value = this.value + (+prompt("Сколько хотите добавить?","0"));
      return this.value
  };
};

let x = +prompt("Введите начальное число:","0");
let n = +prompt("Введите число накоплений:","0");

while (isNaN(x) || isNaN(n)) {
  alert("Введены некорректные данные. Попробуйте снова.")
  x = +prompt("Введите начальное число:","0");
  n = +prompt("Введите число накоплений:","0");
}

let accumulator = new Accumulator(x); // начальное значение 1

for (i=0;i<n;i++) { 
accumulator.read(); // прибавляет введённое пользователем значение к текущему значению
};

console.log(`Начальное число: ${x}`);
console.log(`Количество аккумуляций: ${n}`);
alert(accumulator.value); // выведет сумму этих значений